NFR_Testing/Performance.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="NFR_Testing">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Performance_Testing_Low">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">2</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Alphabet">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8000</stringProp>
          <stringProp name="HTTPSampler.path">/predict</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;keypoints&quot;: [{&quot;x&quot;:0.3645949363708496,&quot;y&quot;:0.7240530252456665,&quot;z&quot;:-5.588693738900474e-7},{&quot;x&quot;:0.45150837302207947,&quot;y&quot;:0.648549497127533,&quot;z&quot;:-0.020198583602905273},{&quot;x&quot;:0.5101950168609619,&quot;y&quot;:0.5146275758743286,&quot;z&quot;:-0.0212872251868248},{&quot;x&quot;:0.5226097702980042,&quot;y&quot;:0.40054386854171753,&quot;z&quot;:-0.02596849761903286},{&quot;x&quot;:0.5021657943725586,&quot;y&quot;:0.3404342234134674,&quot;z&quot;:-0.02755439653992653},{&quot;x&quot;:0.4547276794910431,&quot;y&quot;:0.4225098788738251,&quot;z&quot;:0.007961568422615528},{&quot;x&quot;:0.470999538898468,&quot;y&quot;:0.33623573184013367,&quot;z&quot;:-0.03427174314856529},{&quot;x&quot;:0.46783646941185,&quot;y&quot;:0.42765629291534424,&quot;z&quot;:-0.058822453022003174},{&quot;x&quot;:0.45790594816207886,&quot;y&quot;:0.5172269940376282,&quot;z&quot;:-0.06419108062982559},{&quot;x&quot;:0.4018481373786926,&quot;y&quot;:0.4247318208217621,&quot;z&quot;:0.004770350642502308},{&quot;x&quot;:0.41737252473831177,&quot;y&quot;:0.3362211287021637,&quot;z&quot;:-0.04547403007745743},{&quot;x&quot;:0.4148767590522766,&quot;y&quot;:0.4639118015766144,&quot;z&quot;:-0.05938538536429405},{&quot;x&quot;:0.4084458649158478,&quot;y&quot;:0.5676688551902771,&quot;z&quot;:-0.052197568118572235},{&quot;x&quot;:0.34891968965530396,&quot;y&quot;:0.43481579422950745,&quot;z&quot;:-0.006067061331123114},{&quot;x&quot;:0.3631158471107483,&quot;y&quot;:0.3549724817276001,&quot;z&quot;:-0.0547511950135231},{&quot;x&quot;:0.3692995309829712,&quot;y&quot;:0.48027724027633667,&quot;z&quot;:-0.049738962203264236},{&quot;x&quot;:0.3685874342918396,&quot;y&quot;:0.5752197504043579,&quot;z&quot;:-0.02812696248292923},{&quot;x&quot;:0.29317042231559753,&quot;y&quot;:0.4507398009300232,&quot;z&quot;:-0.018771963194012642},{&quot;x&quot;:0.30367183685302734,&quot;y&quot;:0.3667384386062622,&quot;z&quot;:-0.04574451968073845},{&quot;x&quot;:0.3175533711910248,&quot;y&quot;:0.4371810257434845,&quot;z&quot;:-0.03538179025053978},{&quot;x&quot;:0.3232554495334625,&quot;y&quot;:0.5009985566139221,&quot;z&quot;:-0.016991080716252327}]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="ASL_Translate">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8005</stringProp>
          <stringProp name="HTTPSampler.path">/translate</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;text&quot;: &quot;Store i Go&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="English_Conversion">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8002</stringProp>
          <stringProp name="HTTPSampler.path">/translate</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;sentence&quot;: &quot;I go to the store&quot;&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Performance_Testing_Medium">
        <intProp name="ThreadGroup.num_threads">15</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">2</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="ASL_Translate" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8005</stringProp>
          <stringProp name="HTTPSampler.path">/translate</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;text&quot;: &quot;Store i Go&quot;&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
            <boolProp name="ResultCollector.success_only_logging">true</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Alphabet">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8000</stringProp>
          <stringProp name="HTTPSampler.path">/predict</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;keypoints&quot;: [{&quot;x&quot;:0.3645949363708496,&quot;y&quot;:0.7240530252456665,&quot;z&quot;:-5.588693738900474e-7},{&quot;x&quot;:0.45150837302207947,&quot;y&quot;:0.648549497127533,&quot;z&quot;:-0.020198583602905273},{&quot;x&quot;:0.5101950168609619,&quot;y&quot;:0.5146275758743286,&quot;z&quot;:-0.0212872251868248},{&quot;x&quot;:0.5226097702980042,&quot;y&quot;:0.40054386854171753,&quot;z&quot;:-0.02596849761903286},{&quot;x&quot;:0.5021657943725586,&quot;y&quot;:0.3404342234134674,&quot;z&quot;:-0.02755439653992653},{&quot;x&quot;:0.4547276794910431,&quot;y&quot;:0.4225098788738251,&quot;z&quot;:0.007961568422615528},{&quot;x&quot;:0.470999538898468,&quot;y&quot;:0.33623573184013367,&quot;z&quot;:-0.03427174314856529},{&quot;x&quot;:0.46783646941185,&quot;y&quot;:0.42765629291534424,&quot;z&quot;:-0.058822453022003174},{&quot;x&quot;:0.45790594816207886,&quot;y&quot;:0.5172269940376282,&quot;z&quot;:-0.06419108062982559},{&quot;x&quot;:0.4018481373786926,&quot;y&quot;:0.4247318208217621,&quot;z&quot;:0.004770350642502308},{&quot;x&quot;:0.41737252473831177,&quot;y&quot;:0.3362211287021637,&quot;z&quot;:-0.04547403007745743},{&quot;x&quot;:0.4148767590522766,&quot;y&quot;:0.4639118015766144,&quot;z&quot;:-0.05938538536429405},{&quot;x&quot;:0.4084458649158478,&quot;y&quot;:0.5676688551902771,&quot;z&quot;:-0.052197568118572235},{&quot;x&quot;:0.34891968965530396,&quot;y&quot;:0.43481579422950745,&quot;z&quot;:-0.006067061331123114},{&quot;x&quot;:0.3631158471107483,&quot;y&quot;:0.3549724817276001,&quot;z&quot;:-0.0547511950135231},{&quot;x&quot;:0.3692995309829712,&quot;y&quot;:0.48027724027633667,&quot;z&quot;:-0.049738962203264236},{&quot;x&quot;:0.3685874342918396,&quot;y&quot;:0.5752197504043579,&quot;z&quot;:-0.02812696248292923},{&quot;x&quot;:0.29317042231559753,&quot;y&quot;:0.4507398009300232,&quot;z&quot;:-0.018771963194012642},{&quot;x&quot;:0.30367183685302734,&quot;y&quot;:0.3667384386062622,&quot;z&quot;:-0.04574451968073845},{&quot;x&quot;:0.3175533711910248,&quot;y&quot;:0.4371810257434845,&quot;z&quot;:-0.03538179025053978},{&quot;x&quot;:0.3232554495334625,&quot;y&quot;:0.5009985566139221,&quot;z&quot;:-0.016991080716252327}]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="English_Conversion" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8002</stringProp>
          <stringProp name="HTTPSampler.path">/translate</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;sentence&quot;: &quot;I go to the store&quot;&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Performance_Testing_High">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">3</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">9</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Alphabet">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8000</stringProp>
          <stringProp name="HTTPSampler.path">/predict</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;keypoints&quot;: [{&quot;x&quot;:0.3645949363708496,&quot;y&quot;:0.7240530252456665,&quot;z&quot;:-5.588693738900474e-7},{&quot;x&quot;:0.45150837302207947,&quot;y&quot;:0.648549497127533,&quot;z&quot;:-0.020198583602905273},{&quot;x&quot;:0.5101950168609619,&quot;y&quot;:0.5146275758743286,&quot;z&quot;:-0.0212872251868248},{&quot;x&quot;:0.5226097702980042,&quot;y&quot;:0.40054386854171753,&quot;z&quot;:-0.02596849761903286},{&quot;x&quot;:0.5021657943725586,&quot;y&quot;:0.3404342234134674,&quot;z&quot;:-0.02755439653992653},{&quot;x&quot;:0.4547276794910431,&quot;y&quot;:0.4225098788738251,&quot;z&quot;:0.007961568422615528},{&quot;x&quot;:0.470999538898468,&quot;y&quot;:0.33623573184013367,&quot;z&quot;:-0.03427174314856529},{&quot;x&quot;:0.46783646941185,&quot;y&quot;:0.42765629291534424,&quot;z&quot;:-0.058822453022003174},{&quot;x&quot;:0.45790594816207886,&quot;y&quot;:0.5172269940376282,&quot;z&quot;:-0.06419108062982559},{&quot;x&quot;:0.4018481373786926,&quot;y&quot;:0.4247318208217621,&quot;z&quot;:0.004770350642502308},{&quot;x&quot;:0.41737252473831177,&quot;y&quot;:0.3362211287021637,&quot;z&quot;:-0.04547403007745743},{&quot;x&quot;:0.4148767590522766,&quot;y&quot;:0.4639118015766144,&quot;z&quot;:-0.05938538536429405},{&quot;x&quot;:0.4084458649158478,&quot;y&quot;:0.5676688551902771,&quot;z&quot;:-0.052197568118572235},{&quot;x&quot;:0.34891968965530396,&quot;y&quot;:0.43481579422950745,&quot;z&quot;:-0.006067061331123114},{&quot;x&quot;:0.3631158471107483,&quot;y&quot;:0.3549724817276001,&quot;z&quot;:-0.0547511950135231},{&quot;x&quot;:0.3692995309829712,&quot;y&quot;:0.48027724027633667,&quot;z&quot;:-0.049738962203264236},{&quot;x&quot;:0.3685874342918396,&quot;y&quot;:0.5752197504043579,&quot;z&quot;:-0.02812696248292923},{&quot;x&quot;:0.29317042231559753,&quot;y&quot;:0.4507398009300232,&quot;z&quot;:-0.018771963194012642},{&quot;x&quot;:0.30367183685302734,&quot;y&quot;:0.3667384386062622,&quot;z&quot;:-0.04574451968073845},{&quot;x&quot;:0.3175533711910248,&quot;y&quot;:0.4371810257434845,&quot;z&quot;:-0.03538179025053978},{&quot;x&quot;:0.3232554495334625,&quot;y&quot;:0.5009985566139221,&quot;z&quot;:-0.016991080716252327}]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>